---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowUnits
source: html/eb2e2154-abc1-c647-12c4-94c6a018d139.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowUnits Property

If true, units are shown in the legend.

## Syntax (C#)
```csharp
public bool ShowUnits { get; set; }
```